Without any changes:
```
------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
INFO - cfn - Create: {'Outputs': {}, 'Parameters': {}, 'Resources': {}}
INFO - cfn - Update: {'Outputs': {}, 'Resources': {}}
INFO - cfn - Delete: {'Outputs': {}, 'Parameters': {}, 'Resources': {}}
INFO - cfn - Terraform delta: 
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
Terraform will perform the following actions:
Plan: 0 to add, 0 to change, 0 to destroy.
```

with this patch to `kubernetes-aws--flux-test` definition:
```
index 5b823c2c..fe12709f 100644
--- a/projects/elife.yaml
+++ b/projects/elife.yaml
@@ -2083,6 +2083,11 @@ kubernetes-aws:
                     max-size: 6
                     desired-capacity: 2
                     ignore-desired-capacity-drift: true
+                addons:
+                    kube-proxy:
+                        version: latest
+                    coredns:
+                        version: latest
                 iam-oidc-provider: true
                 iam-roles:
                     kubernetes-autoscaler:
```

We get:
```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_addon.eks_addon_coredns will be created
  + resource "aws_eks_addon" "eks_addon_coredns" {
      + addon_name           = "coredns"
      + addon_version        = "v1.9.3-eksbuild.3"
      + arn                  = (known after apply)
      + cluster_name         = "kubernetes-aws--flux-test"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Cluster"     = "kubernetes-aws--flux-test"
          + "Environment" = "flux-test"
          + "Name"        = "kubernetes-aws--flux-test"
          + "Project"     = "kubernetes-aws"
        }
      + tags_all             = {
          + "Cluster"     = "kubernetes-aws--flux-test"
          + "Environment" = "flux-test"
          + "Name"        = "kubernetes-aws--flux-test"
          + "Project"     = "kubernetes-aws"
        }
    }

  # aws_eks_addon.eks_addon_kube_proxy will be created
  + resource "aws_eks_addon" "eks_addon_kube_proxy" {
      + addon_name           = "kube-proxy"
      + addon_version        = "v1.25.9-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "kubernetes-aws--flux-test"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Cluster"     = "kubernetes-aws--flux-test"
          + "Environment" = "flux-test"
          + "Name"        = "kubernetes-aws--flux-test"
          + "Project"     = "kubernetes-aws"
        }
      + tags_all             = {
          + "Cluster"     = "kubernetes-aws--flux-test"
          + "Environment" = "flux-test"
          + "Name"        = "kubernetes-aws--flux-test"
          + "Project"     = "kubernetes-aws"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```

Which I think is what we want 👍 